In [4]:
import pandas as pd
n = [5,2,3,90]
B = pd.DataFrame(n,columns = ['salem'])
B['Salem_Squared'] =[i**2 for i in n]

In [5]:
B

   salem  Salem_Squared
0      5             25
1      2              4
2      3              9
3     90           8100

In [9]:
import pandas as pd
'''first we create a list'''
students = [90,78,88,74,60]
'''then we create the header of the column'''
X = pd.DataFrame(students,columns = ['results'])
X['students_squared'] = [a**2 for a in students]

In [10]:
X

   results  students_squared
0       90              8100
1       78              6084
2       88              7744
3       74              5476
4       60              3600

In [20]:

import os
os.listdir()
F =pd.read_csv('kamau.csv')
F.head(2)
F.tail(2)
F.shape
F.country
F.head()

       country  continent   year   lifeExp       pop    gdpPercap;
0  Afghanistan       Asia   1952    28.801   8425333   779.445314;
1  Afghanistan      Asia    1957    30.332   9240934   820.853030;
2  Afghanistan       Asia   1962    31.997  10267083   853.100710;
3  Afghanistan       Asia   1967    34.020  11537966   836.197138;
4  Afghanistan       Asia   1972    36.088  13079460   739.981106;

In [24]:
F.iloc[4,2:4]

 year         1972
 lifeExp    36.088
Name: 4, dtype: object

In [35]:
#filter1 =
F[[' year', ' lifeExp', ' pop']]

    year   lifeExp       pop
0   1952    28.801   8425333
1   1957    30.332   9240934
2   1962    31.997  10267083
3   1967    34.020  11537966
4   1972    36.088  13079460

In [33]:
F.columns

Index(['country', ' continent', ' year', ' lifeExp', ' pop', ' gdpPercap;'], dtype='object')